`terraform plan`
```
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform planned the following actions, but then encountered a problem:

  # module.members.github_membership.member["Futadaruma"] will be created
  + resource "github_membership" "member" {
      + downgrade_on_destroy = false
      + etag                 = (known after apply)
      + id                   = (known after apply)
      + role                 = "member"
      + username             = "Futadaruma"
    }

  # module.members.github_membership.member["Kuh456"] will be created
  + resource "github_membership" "member" {
      + downgrade_on_destroy = false
      + etag                 = (known after apply)
      + id                   = (known after apply)
      + role                 = "member"
      + username             = "Kuh456"
    }

  # module.members.github_membership.member["Nattuki"] will be created
  + resource "github_membership" "member" {
      + downgrade_on_destroy = false
      + etag                 = (known after apply)
      + id                   = (known after apply)
      + role                 = "member"
      + username             = "Nattuki"
    }

  # module.members.github_membership.member["Series-205"] will be created
  + resource "github_membership" "member" {
      + downgrade_on_destroy = false
      + etag                 = (known after apply)
      + id                   = (known after apply)
      + role                 = "member"
      + username             = "Series-205"
    }

  # module.members.github_membership.member["YMAC-STICK"] will be created
  + resource "github_membership" "member" {
      + downgrade_on_destroy = false
      + etag                 = (known after apply)
      + id                   = (known after apply)
      + role                 = "member"
      + username             = "YMAC-STICK"
    }

  # module.members.github_membership.member["alex3333python"] will be created
  + resource "github_membership" "member" {
      + downgrade_on_destroy = false
      + etag                 = (known after apply)
      + id                   = (known after apply)
      + role                 = "member"
      + username             = "alex3333python"
    }

  # module.members.github_membership.member["aster34"] will be created
  + resource "github_membership" "member" {
      + downgrade_on_destroy = false
      + etag                 = (known after apply)
      + id                   = (known after apply)
      + role                 = "member"
      + username             = "aster34"
    }

  # module.members.github_membership.member["ayanakm"] will be created
  + resource "github_membership" "member" {
      + downgrade_on_destroy = false
      + etag                 = (known after apply)
      + id                   = (known after apply)
      + role                 = "member"
      + username             = "ayanakm"
    }

  # module.members.github_membership.member["blancnoir256"] will be created
  + resource "github_membership" "member" {
      + downgrade_on_destroy = false
      + etag                 = (known after apply)
      + id                   = (known after apply)
      + role                 = "member"
      + username             = "blancnoir256"
    }

  # module.members.github_membership.member["hyde616"] will be created
  + resource "github_membership" "member" {
      + downgrade_on_destroy = false
      + etag                 = (known after apply)
      + id                   = (known after apply)
      + role                 = "member"
      + username             = "hyde616"
    }

  # module.members.github_membership.member["jippo-m"] will be created
  + resource "github_membership" "member" {
      + downgrade_on_destroy = false
      + etag                 = (known after apply)
      + id                   = (known after apply)
      + role                 = "member"
      + username             = "jippo-m"
    }

  # module.members.github_membership.member["kamecha"] will be created
  + resource "github_membership" "member" {
      + downgrade_on_destroy = false
      + etag                 = (known after apply)
      + id                   = (known after apply)
      + role                 = "member"
      + username             = "kamecha"
    }

  # module.members.github_membership.member["kn-tech"] will be created
  + resource "github_membership" "member" {
      + downgrade_on_destroy = false
      + etag                 = (known after apply)
      + id                   = (known after apply)
      + role                 = "member"
      + username             = "kn-tech"
    }

  # module.members.github_membership.member["mirin-mochigome"] will be created
  + resource "github_membership" "member" {
      + downgrade_on_destroy = false
      + etag                 = (known after apply)
      + id                   = (known after apply)
      + role                 = "member"
      + username             = "mirin-mochigome"
    }

  # module.members.github_membership.member["motoki317"] will be created
  + resource "github_membership" "member" {
      + downgrade_on_destroy = false
      + etag                 = (known after apply)
      + id                   = (known after apply)
      + role                 = "member"
      + username             = "motoki317"
    }

  # module.members.github_membership.member["mtaku3"] will be created
  + resource "github_membership" "member" {
      + downgrade_on_destroy = false
      + etag                 = (known after apply)
      + id                   = (known after apply)
      + role                 = "member"
      + username             = "mtaku3"
    }

  # module.members.github_membership.member["nagaeki"] will be created
  + resource "github_membership" "member" {
      + downgrade_on_destroy = false
      + etag                 = (known after apply)
      + id                   = (known after apply)
      + role                 = "member"
      + username             = "nagaeki"
    }

  # module.members.github_membership.member["nokhnaton"] will be created
  + resource "github_membership" "member" {
      + downgrade_on_destroy = false
      + etag                 = (known after apply)
      + id                   = (known after apply)
      + role                 = "member"
      + username             = "nokhnaton"
    }

  # module.members.github_membership.member["noya2ruler"] will be created
  + resource "github_membership" "member" {
      + downgrade_on_destroy = false
      + etag                 = (known after apply)
      + id                   = (known after apply)
      + role                 = "member"
      + username             = "noya2ruler"
    }

  # module.members.github_membership.member["ogu-kazemiya"] will be created
  + resource "github_membership" "member" {
      + downgrade_on_destroy = false
      + etag                 = (known after apply)
      + id                   = (known after apply)
      + role                 = "member"
      + username             = "ogu-kazemiya"
    }

  # module.members.github_membership.member["pippi0057"] will be created
  + resource "github_membership" "member" {
      + downgrade_on_destroy = false
      + etag                 = (known after apply)
      + id                   = (known after apply)
      + role                 = "member"
      + username             = "pippi0057"
    }

  # module.members.github_membership.member["reiroop"] will be created
  + resource "github_membership" "member" {
      + downgrade_on_destroy = false
      + etag                 = (known after apply)
      + id                   = (known after apply)
      + role                 = "member"
      + username             = "reiroop"
    }

  # module.members.github_membership.member["riku6174"] will be created
  + resource "github_membership" "member" {
      + downgrade_on_destroy = false
      + etag                 = (known after apply)
      + id                   = (known after apply)
      + role                 = "member"
      + username             = "riku6174"
    }

  # module.members.github_membership.member["ryerust"] will be created
  + resource "github_membership" "member" {
      + downgrade_on_destroy = false
      + etag                 = (known after apply)
      + id                   = (known after apply)
      + role                 = "member"
      + username             = "ryerust"
    }

  # module.members.github_membership.member["ultsaza"] will be created
  + resource "github_membership" "member" {
      + downgrade_on_destroy = false
      + etag                 = (known after apply)
      + id                   = (known after apply)
      + role                 = "member"
      + username             = "ultsaza"
    }

  # module.hackathon.module.h24s_children_teams["h23s_04"].github_team.team will be created
  + resource "github_team" "team" {
      + create_default_maintainer = false
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "h23s_04"
      + node_id                   = (known after apply)
      + parent_team_id            = "10278337"
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # module.hackathon.module.h24s_children_teams["h24s_10"].github_team.team will be created
  + resource "github_team" "team" {
      + create_default_maintainer = false
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "h24s_10"
      + node_id                   = (known after apply)
      + parent_team_id            = "10278337"
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # module.hackathon.module.h24s_children_teams["h24s_13"].github_team.team will be created
  + resource "github_team" "team" {
      + create_default_maintainer = false
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "h24s_13"
      + node_id                   = (known after apply)
      + parent_team_id            = "10278337"
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # module.hackathon.module.h24s_children_teams["h24s_14"].github_team.team will be created
  + resource "github_team" "team" {
      + create_default_maintainer = false
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "h24s_14"
      + node_id                   = (known after apply)
      + parent_team_id            = "10278337"
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # module.hackathon.module.h24s_children_teams["h24s_16"].github_team.team will be created
  + resource "github_team" "team" {
      + create_default_maintainer = false
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "h24s_16"
      + node_id                   = (known after apply)
      + parent_team_id            = "10278337"
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # module.hackathon.module.h24s_children_teams["h24s_32"].github_team.team will be created
  + resource "github_team" "team" {
      + create_default_maintainer = false
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "h24s_32"
      + node_id                   = (known after apply)
      + parent_team_id            = "10278337"
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # module.hackathon.module.h24s_parent_team.github_team_members.team_members will be updated in-place
  ~ resource "github_team_members" "team_members" {
        id      = "10278337"
        # (1 unchanged attribute hidden)

      + members {
          + role     = "member"
          + username = "Futadaruma"
        }
      + members {
          + role     = "member"
          + username = "H1rono"
        }
      + members {
          + role     = "member"
          + username = "Kuh456"
        }
      + members {
          + role     = "member"
          + username = "Luftalian"
        }
      + members {
          + role     = "member"
          + username = "Nattuki"
        }
      + members {
          + role     = "member"
          + username = "Pugma"
        }
      + members {
          + role     = "member"
          + username = "Series-205"
        }
      + members {
          + role     = "member"
          + username = "alex3333python"
        }
      + members {
          + role     = "member"
          + username = "alter334"
        }
      + members {
          + role     = "member"
          + username = "aster34"
        }
      + members {
          + role     = "member"
          + username = "ayanakm"
        }
      + members {
          + role     = "member"
          + username = "blancnoir256"
        }
      + members {
          + role     = "member"
          + username = "eyerust"
        }
      + members {
          + role     = "member"
          + username = "hyde616"
        }
      + members {
          + role     = "member"
          + username = "jippo-m"
        }
      + members {
          + role     = "member"
          + username = "kamecha"
        }
      + members {
          + role     = "member"
          + username = "karo1111111"
        }
      + members {
          + role     = "member"
          + username = "kn-tech"
        }
      + members {
          + role     = "member"
          + username = "mathsuky"
        }
      + members {
          + role     = "member"
          + username = "mehm8128"
        }
      + members {
          + role     = "member"
          + username = "motoki317"
        }
      + members {
          + role     = "member"
          + username = "mtaku3"
        }
      + members {
          + role     = "member"
          + username = "nagaeki"
        }
      + members {
          + role     = "member"
          + username = "nokhnaton"
        }
      + members {
          + role     = "member"
          + username = "noya2ruler"
        }
      + members {
          + role     = "member"
          + username = "ogu-kazemiya"
        }
      + members {
          + role     = "member"
          + username = "pippi0057"
        }
      + members {
          + role     = "member"
          + username = "pirosiki197"
        }
      + members {
          + role     = "member"
          + username = "reiroop"
        }
      + members {
          + role     = "member"
          + username = "riku6174"
        }
      + members {
          + role     = "member"
          + username = "trasta298"
        }
      + members {
          + role     = "member"
          + username = "ultsaza"
        }
      + members {
          + role     = "member"
          + username = "zer0-star"
        }

        # (8 unchanged blocks hidden)
    }

Plan: 31 to add, 1 to change, 0 to destroy.

```